Revit 2024 API
PolylineSegments.GetVertices Method
 Returns an array of vertices of the polyline segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public IList<XYZ> GetVertices()
Visual Basic
Public Function GetVertices As IList(Of XYZ)
Visual C++
public:
IList<XYZ^>^ GetVertices()
Return Value
 Array of XYZ points.
See Also
PolylineSegments Class
Autodesk.Revit.DB Namespace